Adithya Institute of Technology
Osmania University
Manipal University
University College Of EngineeringBirla Institute Of Technology Rashtriya Military School BangaloreArmy institute of technology Acharya College ChemburSaraswati College Of EngineeringAG&SGS Intermediate CollegeDegree CollegeBiju Patnaik UniversityHr. Sec. School
Tamil Nadu Board Of EducationVelammal Engineering CollegeNarsee Monjee Institute of Management StudiesLovely Public Sr. Sec. SchoolNorthern India engineering college, IP UNIVERSITY DELHIrajasthan University
Compucom Insitute of Information Technology
REiume Institute of roadNetworking, Infosys LimitedVidyodaya P.U. CollegeVisvesvaraya Technological University
Srinivas Institute of TechnologyManipal Academy of Higher EducationSchool Of Information Sciences
Little Rock Indian School
Silver Bells Public School -  Muzaffarnagar, Uttar PradeshParatap Public School -  Karnal, HaryanaMM UniversitySSVPS’s Late B. S. Deore College of EngineeringSister Nivedita School Lovely Professional UniversityinDR N.G.P ARTS AND SCIENCE COLLEGE Padmavani High School
Vani Jr collegeKuppam Engineering CollegeRajah college
PES collegeVivekananda PU CollegeVivekananda Degree College, Bangalore
UniversityMeghnad saha institute of technology
Canossa Convent School
Canossa Convent Girls Inter College
Amity University Rajiv Gandhi Institute of TechnologyAl-Ameen PU CollegeVisveswaraiah Technological UniversityKIIT college of Engg.Guru Nanak English High School and Jr cllgVedanta College of management and information technologyUPTU. IndiaCentral India Institute
IIITVITVijaya High SchoolVijaya composite p.u. collegeVtu Institute of Road and Transport MayNotre Dame Academy Vellore Institute of Technology Annamacharya Institute of TechnologyVisvesvaraya Technological UniversityDayanand Sagar College of EngineeringAptech Institute of TechnologyKarnataka State University
IGNOU
North Maharashtra University
Vaughn College of Aeronautics and TechnologyNagarjuna UniversityTexas A&M University -  Kingsville, TX
Govt Science CollegeDayananda Sagar College of Engineeringpragathi high schoolnarayana jr.collegevasundhara womensAnna UniversityPune UniversityGovt. High school YernalliITM University GwaliorAnna University Chennai CDAC Mohali CDACPunjab Technical University
Punjab Technical University (PTU)Amrita School of EngineeringAdhiparasakthi Engineering College (Anna University)Great Lakes Institute Of ManagementVSSUT,burla
Mount Carmel Institute of ManagementS.R high School -  Chennai, Tamil Nadu
Pratibha Junior CollegeGMR Institute of Technology and ManagementDr. R.M.L.S COLLEGER.D.S COLLEGE Dr MGR University ChennaiSt. Joseph's convent school
Padmanava College of Engineering
JAWAHARLAL NEHRU TECHNOLOGICAL UNIVERSITY
Vignan Vidyalayam High SchoolGowtham Jr. College -M. V. G. R College of EngineeringKalinga Institute of Industrial Technology
CHHATTISGARH SWAMI VIVEKANANDA TECHNICAL UNIVERSITY
St. John's School
National Institute Of Technology
Saranathan College of Engineering Shivaji UniversityMaharashtra Board
Frankfinn Institute of Airhostess Training Vivekananda Engineering College for WomenFrankfinn Institute of Airhostess TrainingAvinashilingam Deemed UniversityS.B.K.V higher secondary schoolAvinashilingam Institute for Home Science & Higher Education for Women
ODM Pubic schoolCollege of engineeringKakatiya UniversityConvent Girls' High SchoolD.G Ruparel CollegeVisveswaraiah Technological University -B V Bhoomaraddi College of Engg and Technology HubliMaharashtra State Government, Pune UniversityIndian Institute Of Company Secretory Of India (Appeared)
Nagarjuna University
Jawaharlal Nehru Technological UniversityPondicherry UniversityCollege of EngineeringShri gnanambika degree collegeIndian Institutes of Technology IIT KanpurUniversity of ChicagoTVS Lakshmi Matriculation Higher Secondary SchoolSri Sathya Sai Institute of Higher Learning Thiagarajar School of Management GLA Institute of Technology and ManagementDay Adventist Matric Hr.Sec School
ANNA University
Government Boys Higher Secondary School Nandha Engineering CollegeHosanna National High SchoolVidya Bharati Institute Of Technology -  HindupurKGISLGNIT institute of Technology Madurai Kamaraj UniversityGGSIPUNitte Meenakshi Institute of TechnologyamityVSSUT,burlaOsmania UniversityCalicut UniversityC-DACNMKRV College, Bangalore UniversityJAIN COLLEGETrinity engineering college
Product SchoolShri Vaishnav Institute of Technology and Science, RGPV University IIT Roorkee Christ University Faculty of Engineering br day public schoolEast Point College of Engg. & Tech.Surendranath college BarrackporeSR ENGINEERING COLLEGE (SREC)Gtti -Jaipur Engineering College and Research Centerchandigarh university Narsee Monji Osmania University Microsoft Virtual Academy
Bhagabati Nodal High Schoolards collage kadapaMagadh univercity Saurashtra UniversityFrankfinn Institute of Airhostess Training -Vivekananda Engineering College for Women sunder deep group of institution 
GRAPHIC ERA UNIVERSITYIIT Delhi
DAVVSinhgad Institute
Periyar University
SRM Universityaffiliated -  Kota, RajasthanPeriyar University Vijaya mainMagadh universityGandhi Institute of Science And Technology (GITAM) University
Kerala UniversityV V Pura College of ScienceGujarat University
KSV UniversityTrue Vision TechnologyAdministrative Management College Bangalore UniversityMaharashtra Institute of TechnologyAndhra UniversityPeriyar UniversityBoard (university)Kerala StateChitkara University
Sri Venkateswara College of Engineering and Technology Affiliated -PES College of Engineering -S.N.G College, Bharathiar University
Orange City Hospital & Research InstituteTechnical Board of Education Bombay Amravati University -  Amravati, Maharashtra
Nagarjuna university
affiliated college of Andhra UniversityBPUT Chhattisgarh Board of Secondary EducationC V Raman University BilaspurBhilai Institute of TechnologyPanimalar Engineering CollegeBharathiyar University Nagpur Polytechnic -  Nagpur, Maharashtra
Amrita School of Engineering -Georgia Institute of TechnologyS.V UniversityJiwaji UniversityNew Horizon College, (Bangalore University)Galgotias University
Jaypee Institute Of Information Technology MS University Anna University Birla Institute Tejaa Shakthi Institute of Technology for WomensLucknow Public Inter College2011Saroj Institute of Technology & Management Manipal UniversityNMAM Institute of Technology
University of RajasthanKurukshetra UniversityPSG COLLEGE OF TECHNOLOGY, ANNA UNIVERSITY Board of Technical Education
BITS PilaniWest Bengal State University
shivaji UniversitySRIKALAHASTEESWARA INSTITUTE OF TECHNOLOGYSchoolRamkrishna krida HighAdi Sankara Polytechnic College ST.Joseph college 
Indraprastha Public SchoolUttrakhand Technical University
Acharya Nagarjuna UniversitySreenidhi Institute of science and technologyIndian Terrain Fashions Limited -
Bishop Ambrose College, Bharathiar UniversityPalesh Commerce CollegeRCPET's I.M.R.D CollegeIndraprastha Engineering College, Uttar Pradesh Technical UniversitySt. Paul's AcademyArmy Public School Barrackpore Rastraguru Surendranath College Ballygunge Science College University of CalcuttaSikkim Manipal UniversityGovernment Engineering College BhujRamakrishna CollegeBharathiar UniversityJawaharlal Nehru Technological University 