OracleCloud Lending SolutionsOracle Retail
Oracle CorporationState Street
Oracle Financial Software ServicesNIIT SAP FICOSap labsInfosys LimitedInfosys Limited
Microsoft India Infosys LtdCiscoAccenture SAP ABAP SAP -Infosys limited
Cisco Infosys LimitedWiproAccentureMicrosoftInfosysSAP ABAPAggrigatorCISCOSAPOracle India Pvt LtdHCL Technologies -
Disney
Infosys -  Pune, Maharashtra -
Infosys/Offshore LeadOracle IncSAP ARIBA SAP EWMSAP INFOSYS LIMITEDORACLE -Sasken Technologies Pvt. Ltd -  Arrow Electronics IncCisco SystemsInfosys Limited TATA Communications Ltd
Aricent Group HCL SAP Labs SAP AGAmazonGreymeter.comAmazon Development CentreOracle Fusion MiddlewareCisco Microsoft Corporation
Oracle India Pvt ltdOracle Financial ServicesOracle India Private LimitedCompany 1Oracle India Cisco SystemsIndPvtLtdOracle MongoDBTavantSAP BasisAutomation & Testing
Microsoft SharePoint -
Infosys LTDApple , Google, Microsoft -Teleperformance for MicrosoftShuttlMicrosoft -DELL EMCWipro
Technologies.
Accenture ServicesMicrosoft GPSMicrosoft,Infosis, GoogleSITEL -
Microsoft India -Microsoft 
TCSNokia & Microsoft mobile Neudesic (Vendor @ Microsoft)
Infosys and microsoftNokia and Microsoft -
Teleperformance
Microsoft & Xiaomi
Microsoft MICROSOFTMICROSOFT CognizantVelammal NewLabourNet Services India
Pvt LtdPartner Sites Infosys, Concentrix, Merchants and Convergys

Collabera Technologies- Client- Cisco Systems, Inc AllscriptsTech Mahindra Ltd TCS Hinjewadi Mail
Room Boy & HK StoreOffice BeaconINFOSYS EIT Services India Private Limited HiPower Support CentreInternational Travel House LimitedIBM CSC  HR ExecutiveOceanic ConsultantsCognizant technology Solutions InfosysSun infosys Site at Shendra MIDC Aurangabad -
Perkins India Ltd
STAR India
Founding Years Learning SolutionsThoughtWorks TechnologiesInfosys Bangalore Skava an Infosys CompanyInfosys Ltd/Edgeverve Systems Ltd Infosys Infosys Ltd Infosys OpenStack Infosys limitedAricent Technologies
TCSinfosysMicrosoft
Pune UniversityMicrosoft

Infosys Limited BITS PilaniSoftzel Technologies Pvt. LtdConvergysHCL Technologies
PUNE UNIVERCITYShreenath Engence
(COFFEEDAY)
Shell  Royal Dutch Shell
Infosys BPO LtdInfosys - Career Contour