B.E in Computer Science EngineeringB.Sc. in Computer ScienceMCAB. Tech in Electrical and Electronics in Embedded Systems
Statistics and ProbabilityBachelor of Technology in Computer ScienceCBSE in Mathematics and English
Bachelor of Enginerring in Information TechnologyState BoardHSC in Computer science
BE (Computer Science) in Computer Science
B.com
B. Tech in Electronics and Communication
B E in Production EngineeringPGDBMCBSEB.Tech in Engineering
B.Tech in Information TechnologyBachelor of Engineering in Information TechnologyFoundation Training Program in Networking
Bachelor of Engineering in EngineeringMaster of Science in Technology in Technology
School Of Information SciencesB.Tech in CSEBE in computer scienceBoard of Intermediate educationSecondary School Certificate in education
Bachelor Of Engineering in Mechanical EngineeringBachelor of computer science in computer science
B-TechS.S.C in computer scienceMaster degree in computer science in computer scienceBachelors in Commerce (B.Com) B.TECH. in Information Technology
B.E in Electronics & Communication
B.techBachelor of Computer ApplicationH.S.CTYBMS in Management StudiesMaster of Computer ApplicationBachelor in ElectronicsM.Tech. in ITe-commerceBtech information science in BCET
B.Tech
C.B.S.E.
Bachelor of Technology in Information TechnologyB.TechB.E
Computer NetworkingBACHELOR'S IN SCIENCE in COMPUTER NETWORKING
MCL in Computer Application
B.E. in ENCBachelor Of ScienceB.S. in Electronics & Communications Engineering
M.S. in Computer Engineering
BACHELOR OF SCIENCE in ElectronicsMCA in COMPUTER APPLICATIONBSc in Computer ScienceMaster of Engineering in Computer and CommunicationB.E.B.E. in ElectricalBachelor of Engineering in Mechanical EngB.Tech in TechnologyAndroidBachelor of Engineering in Engineering
Client-Server ArchitectureBachelor of Technology in TechnologyBACHELOR OF ENGINEERING in ELECTRONICS & COMMUNICATION
ENGINEERINGPost Graduate Program in Business Analytics & Business Intelligence in
BUSINESSElectrical engineering
Post Graduate Diploma in Business Administration in Marketing and
Human ResourceBachelor of Commerce in CommerceB.Tech in Computer Science in Computer Science
B.E in CSE
B-TECHSSCMPC subjectBachelors in Computer Science
C.S.B.Tech in EEEBachelor in "Instrumentation and Control Engineering"
B.E in Electronics & TelecommunicationSSC
HSCState Board
BTEC HNC in Aviation in Hospitality and Travel ManagementBE in Computer Science and EngineeringState Board +2
BTEC HNC in AviationBE Computer Science MBA in Finance and sectorial specialisation
CBSE
B-tech in Electronics and Telecommunication
BSC in Computer science
MSC in Computer scienceBachelor of Engineering (Information Science) in Information Science
Bachelor of Technology in Electronics and Communications
Post Graduate Diploma in Embedded SystemsM.Tech in Power Electronics and Instrumentation Engineering
B.Tech in Electrical and Electronics EngineeringB Tech Honors in TechnicalBscBachelor of Technology in Civil EngineeringMaster of Science in Financial Mathematics
SSLCBScMCA in Computer Applications
Bachelor of Technology in Electronics and Communication EngineeringB.E in CSEBachelor of Engineering in Electronics and Communication in Electronics
and Communication
B. Tech in ECE
BCA,MBABachelor of Technology in Electronics & communication EnggB.Com in Computer Application
B.Tech(Computer Science) in CSE
Bachelor of Engineering in Digital Marketing
masters in journalism and communication in mass comm client servicingMasters in journalism and communicationElectrical engineeringMaster's
MBA in marketing-tourismBachelor of Engineering in MicrosoftBachelor's in Commerce
B.COMbtechBachelor of Computer Science in Computer Science Engineering

Software Product ManagementBachelor of Engineering in Electronics and Communication
MBA in MarketingBachelor of Technology in BranchBachelor (B Tech) in Name of the Education Establishment
Diploma in MracB. Techpass 12 in medicalPGDBM in Business Management
B.Sc in Electronics
MBA in Marketing and Human ResourcesCertificate of AchievementStill StudyingDegree,BSc(MECs) 2nd year
BSc in ComputerBSc in Math
BTEC HNC in Aviation in Hospitality and Travel Management
BE in Computer Science and Engineering
b.tech in computer scienceB.TECH in EngineeringB-tech (CSE)
Bachelor of Commerce in Commerce business managementBEB.EBCAMongo
B.SC
B.Tech in CSE
B.B.A in UITB.C.AMSCachelor of Computer Application in Computer ApplicationBtechB.Sc. in M.P.C
P.G.D.C.A in Computer Applications
Master of Science in Information Technology and ManagementHigher Secondary CertificateB. E. in CSE
B.Tech in Electronics and Communication EngineeringB.B.A in Airport & Customer Care ManagementB.Sc. in Microbiology in Microbiology
Diploma in INDUSTRIAL ELECTRONICS
Bachelor of Engineering in ELECTRONICS AND TELECOMMUNICATIONB.Sc in Maths, Physics and ComputersM.C.AB.Tech in Electronics and telecommunication
Bachelor of Computer Applications in Computer ApplicationsMaster of Computer Applications in Computer Applications
Secondary School Certificate in Design PatternBachelor'sDiploma in Electrical Engineering
Bachelor of Technology in Electronics & Communication EngineeringMaster of Science in Electrical & Computer EngineeringB.Com in C.A
Microsoft Certified Windows server 2008 in active directoryBBM in educationMBAB.Tech in ECEB.SC.
MCA in EngineeringB Tech in Sri Ramakrishna
M Tech in Technology & Science
B.Tech. in Information TechnologyMBA in Banking and Finance
B.Sc in Computer Science
PSG College of TechnologyBachelor of Science in Comp. Technology
Masters of Science in Comp. TechnologyMaster'sBachelor'B.E. in Computer ScienceM.S in Software Systems
Bcom 2011B.Com in AccountsBachelor Of Technology in insurance10thDCEDiploma in Challenger info tech
C.B.S.EB.TECH in Computer Science EngineeringBachelor of Engineering in EnTCCertificate in MSC CHEMISTRYBE in Computer scienceMS in Systems Engineering in Systems Engineering
M.D.AMIE sec A
Bachelor of Technology in Computer Science EngineeringB.COM
West Bengal State
B.ScM.Sc in biologyEngineering'O' Level in Computer Application
'A' Level in Computer ApplicationBachelor of ArtsMBA in Information TechnologyBE in Environmental EngineeringB.Sc. in Biochemistry in Biochemistry
Master of Science in Bio Informatics in Bio InformaticsB- Tech
Bachelor en applications informatiques en applications informatiquesMaster en applications informatiques en applications informatiques
Diplôme d'études secondaires en modèle de conceptionDiplôme de baccalauréat en génie électrique
Bachelor of Technology en génie électronique et communicationMaster of Science en génie électrique et informatiqueB.Com in C.A
Serveur Windows certifié Microsoft 2008 dans Active DirectoryBBM dans educationMBAB.Tech dans ECEB.SC.
MCA en ingénierieB Tech à Sri Ramakrishna
M Tech en technologie et science
B.Tech. en technologie de l'informationMBA en banque et finance
B.Sc en informatique
PSG College of TechnologyBachelor of Science en Comp. La technologie
Masters of Science in Comp. TechnologyMaster'sBachelor'B.E. en sciences informatiquesM.S en systèmes logiciels
Bcom 2011B.Com in AccountsBachelor Of Technology in insurance10thDCEDiploma in Challenger info tech
C.B.S.EB.TECH en génie informatiqueBachelor en ingénierie enTertificat en MSC CHEMISTRYBE en informatiqueMS en ingénierie des systèmes en ingénierie des systèmes
M.D.AMIE sec a
Baccalauréat en technologie en génie informatiqueB.COM
État du Bengale occidental
B.Sc.Sc en biologieIngénierie 'O' Level in Computer Application
Niveau «A» en applications informatiquesBaccalauréat ès ArtsMBA en technologies de l'informationBE en génie de l'environnementB.Sc. en biochimie en biochimie
Maîtrise universitaire en bioinformatique en bioinformatiqueB- Tech